Repository: 21124637/FluentCleaner
Catalog: FluentCleaner/Strings/*/Resources.resw
Source language: en_us
Languages: ro_ro

# NavCleaner.Content
source: Cleaner
ro_ro: Curățare

# NavCustom.Content
source: Custom
ro_ro: Personalizat

# SearchBox.PlaceholderText
source: Search
ro_ro: Căutare

# BtnPageActions.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Page actions
ro_ro: Acțiuni pentru pagină

# DonationBanner.Title
source: Enjoying FluentCleaner?
ro_ro: Îți place FluentCleaner?

# DonationBanner.Subtitle
source: If this app saves you time, consider supporting its development.
ro_ro: Dacă această aplicație îți economisește timp, ia în considerare să îi susții dezvoltarea.

# BtnDonateGitHub.Content
source: Star on GitHub
ro_ro: Dă un Star pe GitHub

# BtnDonateLater.Content
source: Maybe later
ro_ro: Poate mai târziu

# St_NoActions
source: No actions for this page
ro_ro: Nu există acțiuni pentru această pagină

# CleanerHint.Text
source: Winapp2.ini loads automatically at startup.
ro_ro: Winapp2.ini se încarcă automat la pornire.

# BtnCategoryActions.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Category actions
ro_ro: Acțiuni pentru categorie

# MenuSelectAll.Text
source: Select all
ro_ro: Selectează tot

# MenuSelectNone.Text
source: Select none
ro_ro: Deselectează tot

# MenuSelectDefaults.Text
source: Select defaults
ro_ro: Selectează valorile implicite

# MenuAnalyzeCategory.Text
source: Analyze category
ro_ro: Analizează categoria

# MenuCleanCategory.Text
source: Clean category
ro_ro: Curăță categoria

# BtnEntryActions.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Entry actions
ro_ro: Acțiuni pentru element

# MenuAnalyzeEntry.Text
source: Analyze
ro_ro: Analizează

# MenuCleanEntry.Text
source: Clean
ro_ro: Curăță

# MenuExplainEntry.Text
source: Explain with AI
ro_ro: Explică cu AI

# MenuShowSource.Text
source: Show source
ro_ro: Afișează sursa

# LblAIDesc.Text
source: Right-click any entry on the Cleaner page → Explain with AI. Powered by Groq (llama-3.3-70b) — free, no billing. Nothing is sent without your explicit action. Requires your own API key.
ro_ro: Faceți clic dreapta pe orice element din pagina Curățare → Explică cu AI. Alegeți Groq, OpenAI sau Anthropic. Nimic nu este trimis fără acțiunea dumneavoastră explicită. Necesită propria cheie API.

# LblAICustomHint.Text
source: 💡 Once your key is saved, the Custom Cleaners page also unlocks AI — describe what to clean and it generates a ready-to-use Winapp2 entry or PowerShell script for you.
ro_ro: 💡 După ce cheia este salvată, pagina Curățători personalizați deblochează și funcțiile AI — descrieți ce doriți să fie curățat, iar aplicația generează un element Winapp2 sau un script PowerShell gata de utilizare.

# ResultsHeader.Text
source: Results
ro_ro: Rezultate

# BtnBackToResults.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Back to results
ro_ro: Înapoi la rezultate

# BtnCleanDetail.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Delete these files now
ro_ro: Șterge aceste fișiere acum

# MenuExcludeFile.Text
source: Exclude file
ro_ro: Exclude fișierul

# MenuExcludeFolder.Text
source: Exclude folder
ro_ro: Exclude folderul

# BtnAnalyze.Content
source: Analyze
ro_ro: Analizează

# BtnCancel.Content
source: Cancel
ro_ro: Anulează

# BtnRunCleaner.Content
source: Run Cleaner
ro_ro: Rulează curățarea

# St_MenuSelectAll
source: Select all
ro_ro: Selectează tot

# St_MenuSelectNone
source: Select none
ro_ro: Deselectează tot

# St_MenuSelectDefaults
source: Select defaults
ro_ro: Selectează valorile implicite

# St_MenuExpandAll
source: Expand all
ro_ro: Extinde tot

# St_MenuCollapseAll
source: Collapse all
ro_ro: Restrânge tot

# St_MenuSortDesc
source: Sort by size ↓
ro_ro: Sortează după dimensiune ↓

# St_MenuSortAsc
source: Sort by size ↑
ro_ro: Sortează după dimensiune ↑

# St_MenuRefresh
source: Refresh
ro_ro: Reîmprospătează

# DetailHeaderFiles.Text
source: Files
ro_ro: Fișiere

# DetailHeaderRegistry.Text
source: Registry
ro_ro: Registru

# SuffixFiles
source: files
ro_ro: fișiere

# SuffixRegistry
source: registry
ro_ro: registru

# SuffixFilesSingular
source: file(s)
ro_ro: fișier(e)

# SuffixRegistryItems
source: registry item(s)
ro_ro: element(e) din registru

# LabelCleaningComplete
source: Cleaning complete.
ro_ro: Curățarea s-a încheiat.

# DlgBrowsersTitle
source: Browsers running
ro_ro: Browsere deschise

# DlgBrowsersContinue
source: Continue anyway
ro_ro: Continuă oricum

# DlgBrowsersCancel
source: Cancel
ro_ro: Anulează

# DlgBrowsersMessage
source: Close these apps for best results:\n{0}\n\nOpen browsers lock cache and history files — they will be skipped during cleaning.
ro_ro: Închideți aceste aplicații pentru cele mai bune rezultate:\n{0}\n\nBrowserele deschise blochează fișierele de cache și istoricul — acestea vor fi omise în timpul curățării.

# DlgWarningTitle
source: Cleaning warning
ro_ro: Avertisment privind curățarea

# DlgWarningContinue
source: Continue
ro_ro: Continuă

# DlgWarningCancel
source: Cancel
ro_ro: Anulează

# DlgWarningMessage
source: The selected Winapp2 entries include the following warnings:
ro_ro: Intrările Winapp2 selectate includ următoarele avertismente:

# DlgExplainThinking
source: Thinking…
ro_ro: Se analizează…

# DlgExplainClose
source: Close
ro_ro: Închide

# DlgSourceCopy
source: Copy
ro_ro: Copiază

# DlgSourceReport
source: Report entry
ro_ro: Raportează intrarea

# DlgSourceDryRun
source: Dry Run
ro_ro: Testare

# RuleLabTitle
source: Rule Lab — {0}
ro_ro: Laborator de reguli — {0}

# DlgSourceHint
source: Edit the rules, then Dry Run to preview the hits.
ro_ro: Editați regulile, apoi folosiți Testare pentru a previzualiza rezultatele.

# DlgSourceScanning
source: Scanning…
ro_ro: Se scanează…

# DlgSourceNoEntry
source: No valid entry — needs a Detect and a FileKey.
ro_ro: Nu există o intrare validă — sunt necesare Detect și FileKey.

# DlgSourceFound
source: {0} files · {1}
ro_ro: {0} fișiere · {1}

# DlgSourceMore
source: … and {0} more
ro_ro: … și încă {0}

# DlgSourceError
source: Scan failed: {0}
ro_ro: Scanarea a eșuat: {0}

# DlgSourceCancel
source: Cancel
ro_ro: Anulează

# DlgSourceCancelled
source: Cancelled.
ro_ro: Anulat.

# DlgRestartTitle
source: Restart required
ro_ro: Este necesară repornirea

# DlgRestartMessage
source: FluentCleaner needs to restart to apply the changes.
ro_ro: FluentCleaner trebuie repornit pentru a aplica modificările.

# DlgRestartNow
source: Restart now
ro_ro: Repornește acum

# DlgRestartLater
source: Later
ro_ro: Mai târziu

# St_Loading
source: Loading Winapp2.ini...
ro_ro: Se încarcă Winapp2.ini...

# St_SearchFound
source: Showing {0} matching entries.
ro_ro: Sunt afișate {0} intrări corespunzătoare.

# St_SearchNone
source: No matching entries.
ro_ro: Nu au fost găsite intrări corespunzătoare.

# St_ParsingDatabases
source: Parsing databases...
ro_ro: Se analizează bazele de date...

# St_AnalysisReady
source: Analysis ready — {0} apps found in {1} entries.
ro_ro: Analiza este gata — au fost găsite {0} aplicații în {1} intrări.

# St_NothingSelected
source: Nothing selected.
ro_ro: Nu este selectat nimic.

# St_Scanning
source: Scanning...
ro_ro: Se scanează...

# St_ScanComplete
source: Scan complete — {0} files, {1} registry items ({2})
ro_ro: Scanare finalizată — {0} fișiere, {1} elemente din registru ({2})

# St_ScanCancelled
source: Scan cancelled.
ro_ro: Scanarea a fost anulată.

# St_Cleaning
source: Cleaning...
ro_ro: Se curăță...

# St_CleanDone
source: Finished — {0} freed · {1} skipped (files in use)
ro_ro: Finalizat — {0} eliberați · {1} omiși (fișiere în uz)

# St_CleanDoneSimple
source: Finished — {0} items removed · {1} freed.
ro_ro: Finalizat — {0} elemente eliminate · {1} eliberați.

# St_CleanCancelledBytes
source: Clean cancelled — {0} freed so far.
ro_ro: Curățarea a fost anulată — {0} eliberați până acum.

# St_CleanCancelled
source: Clean cancelled.
ro_ro: Curățarea a fost anulată.

# St_EntryScanned
source: {0}: {1} files, {2} registry items
ro_ro: {0}: {1} fișiere, {2} elemente din registru

# St_EntryNothingToClean
source: {0}: nothing to clean.
ro_ro: {0}: nimic de curățat.

# St_EntryCleanDone
source: {0}: {1} items removed · {2} freed.
ro_ro: {0}: {1} elemente eliminate · {2} eliberați.

# St_CategoryScanning
source: Scanning {0}...
ro_ro: Se scanează {0}...

# St_CategoryScanned
source: {0} scanned — {1} entries.
ro_ro: {0} scanată — {1} intrări.

# St_CategoryCleaning
source: Cleaning {0}...
ro_ro: Se curăță {0}...

# St_CategoryCleanDone
source: {0}: {1} items removed · {2} freed.
ro_ro: {0}: {1} elemente eliminate · {2} eliberați.

# St_EntryScanningProgress
source: Scanning {0}...
ro_ro: Se scanează {0}...

# St_ExcludedFile
source: Excluded: {0}
ro_ro: Exclus: {0}

# St_ExcludedFolder
source: Excluded: {0}
ro_ro: Exclus: {0}

# Prog_Deleted
source: Deleted: {0}
ro_ro: Șters: {0}

# Prog_Registry
source: Registry: {0}
ro_ro: Registru: {0}

# SettingsTitle.Text
source: Settings
ro_ro: Setări

# DonationBar.Title
source: FluentCleaner is going open source.
ro_ro: FluentCleaner devine open-source.

# DonationBar.Message
source: Put a lot of work into this — if it helps you and you feel like saying thanks, a donation would really mean a lot. ♥
ro_ro: Am investit multă muncă în acest proiect — dacă îți este util și dorești să-mi mulțumești, o donație ar însemna foarte mult. ♥

# BtnDonate.Content
source: Support the project
ro_ro: Susține proiectul

# MenuDonatePayPal.Text
source: Donate via PayPal
ro_ro: Donează prin PayPal

# MenuDonateKoFi.Text
source: Donate via Ko-fi
ro_ro: Donează prin Ko-fi

# SectionAppearance.Text
source: Appearance
ro_ro: Aspect

# LblTheme.Text
source: App theme
ro_ro: Tema aplicației

# LblThemeDesc.Text
source: Choose how FluentCleaner looks on your device.
ro_ro: Alege cum va arăta FluentCleaner pe dispozitivul tău.

# ThemeSystem.Content
source: System default
ro_ro: Implicită a sistemului

# ThemeLight.Content
source: Light
ro_ro: Deschisă

# ThemeDark.Content
source: Dark
ro_ro: Închisă

# LblLanguage.Text
source: Language
ro_ro: Limbă

# LblLanguageDesc.Text
source: Override the display language. Restart required to apply.
ro_ro: Suprascrie limba de afișare. Este necesară repornirea pentru aplicarea modificărilor.

# St_LangAuto
source: System default
ro_ro: Implicită a sistemului

# SectionDatabase.Text
source: Database
ro_ro: Bază de date

# LblDatabaseDesc.Text
source: Choose which entry lists are loaded for scanning and cleaning.
ro_ro: Alege ce liste de intrări sunt încărcate pentru scanare și curățare.

# BtnUpdateWinapp2.Content
source: Update
ro_ro: Actualizează

# LblWinapp3Desc.Text
source: — more aggressive entries, use at your own risk.
ro_ro: — intrări mai agresive, utilizați pe propria răspundere.

# BtnDownloadWinapp3.Content
source: Download
ro_ro: Descarcă

# BtnUpdateWinapp3.Content
source: Update
ro_ro: Actualizează

# LblWinappxDesc.Text
source: — AppX / bloatware entries for the terminal debloater.
ro_ro: — intrări AppX / bloatware pentru utilitarul de eliminare din Terminal.

# BtnDownloadWinappx.Content
source: Download
ro_ro: Descarcă

# BtnUpdateWinappx.Content
source: Update
ro_ro: Actualizează

# TxtCustomPath.PlaceholderText
source: Custom database path (.ini)
ro_ro: Cale către baza de date personalizată (.ini)

# BtnBrowse.Content
source: Browse…
ro_ro: Răsfoiește…

# BtnApplyPath.Content
source: Apply
ro_ro: Aplică

# BtnRemovePath.[using:Microsoft.UI.Xaml.Controls]ToolTipService.ToolTip
source: Remove custom database
ro_ro: Elimină baza de date personalizată

# RestartBar.Title
source: Restart required
ro_ro: Este necesară repornirea

# RestartBar.Message
source: Please restart FluentCleaner to load the updated database.
ro_ro: Reporniți FluentCleaner pentru a încărca baza de date actualizată.

# SectionPostClean.Text
source: Post-clean tasks
ro_ro: Acțiuni după curățare

# LblPostCleanDesc.Text
source: One command per line — runs sequentially after every clean pass.
ro_ro: O comandă pe fiecare linie — se execută succesiv după fiecare operațiune de curățare.

# SectionExclusions.Text
source: Global exclusions
ro_ro: Excluderi globale

# LblExclusionsDesc.Text
source: Paths listed here are never cleaned — overrides all database rules.
ro_ro: Căile listate aici nu sunt curățate niciodată — au prioritate față de toate regulile bazei de date.

# LnkProtectedPaths.Content
source: View protected paths
ro_ro: Vezi căile protejate

# DlgProtectedTitle
source: Protected paths
ro_ro: Căi protejate

# DlgProtectedDesc
source: These are always skipped, no matter what the database says. They hold browser extension data that some apps (password managers, ad blockers) break without.
ro_ro: Aceste locații sunt întotdeauna omise, indiferent de regulile bazei de date. Ele conțin date ale extensiilor de browser de care depind unele aplicații (manageri de parole, blocatoare de reclame etc.).

# SectionHistory.Text
source: History
ro_ro: Istoric

# LblHistoryDesc.Text
source: Track how much junk accumulates over time.
ro_ro: Urmărește cât spațiu ocupă fișierele inutile în timp.

# LblCleanHistory.Text
source: Clean history
ro_ro: Istoricul curățării

# BtnClearHistory.Content
source: Clear history
ro_ro: Șterge istoricul

# SectionAI.Text
source: AI explanations
ro_ro: Explicații AI

# LblAIOptIn.Text
source: opt-in
ro_ro: opțional

# LblAIPreview.Text
source: preview
ro_ro: previzualizare

# BtnAIDiscussion.Content
source: Thoughts? Join the discussion →
ro_ro: Ai sugestii? Alătură-te discuției →

# BtnSaveApiKey.Content
source: Save
ro_ro: Salvează

# BtnTestApiKey.Content
source: Test
ro_ro: Testează

# BtnGetApiKey.Content
source: Get key
ro_ro: Obține cheia

# SectionBackup.Text
source: Backup
ro_ro: Copie de rezervă

# LblBackupDesc.Text
source: Export or import your settings as a JSON file. Drop a settings.json next to the exe for portable mode.
ro_ro: Exportă sau importă setările într-un fișier JSON. Pentru modul portabil, plasează un fișier settings.json lângă executabil.

# BtnExport.Content
source: Export
ro_ro: Exportă

# BtnImport.Content
source: Import
ro_ro: Importă

# LblPortableActive.Text
source: 📦 Portable mode active — settings stored next to exe
ro_ro: 📦 Modul portabil este activ — setările sunt stocate lângă executabil

# SectionAbout.Text
source: About
ro_ro: Despre

# LblCopyright.Text
source: © 2026 A Belim app creation
ro_ro: © 2026 O aplicație creată de Belim

# BtnReportIssue.Content
source: Report an issue
ro_ro: Raportează o problemă

# BtnIconCredit.Content
source: App icon by naderi
ro_ro: Pictograma aplicației de naderi

# BtnFAQ.Content
source: FAQ
ro_ro: Întrebări frecvente

# St_Winapp3NotDownloaded
source: Winapp3 not downloaded yet — click Download.
ro_ro: Winapp3 nu a fost încă descărcat — faceți clic pe Descarcă.

# St_WinappxNotDownloaded
source: Winappx not downloaded yet — click Download.
ro_ro: Winappx nu a fost încă descărcat — faceți clic pe Descarcă.

# St_HistoryNone
source: no runs recorded yet
ro_ro: încă nu există rulări înregistrate

# St_HistorySummary
source: {0} runs · {1} total freed
ro_ro: {0} rulări · {1} eliberați în total

# St_HistoryItems
source: {0} items
ro_ro: {0} elemente

# St_FileNotFound
source: File not found: {0}
ro_ro: Fișier negăsit: {0}

# St_CustomPathSaved
source: Custom path saved.
ro_ro: Calea personalizată a fost salvată.

# St_Download
source: Download
ro_ro: Descarcă

# St_Downloading
source: Downloading {0}…
ro_ro: Se descarcă {0}…

# St_Downloaded
source: {0} downloaded — {1} KB
ro_ro: {0} descărcat — {1} KB

# St_DownloadFailed
source: Download failed: {0}
ro_ro: Descărcarea a eșuat: {0}

# St_FileInfoNotDownloaded
source: Not downloaded
ro_ro: Nedescărcat

# St_FileInfo
source: {0} entries • {1} KB • {2}
ro_ro: {0} intrări • {1} KB • {2}

# St_UpdateAvailable
source: Update available — {0}
ro_ro: Actualizare disponibilă — {0}

# St_UpdateMessage
source: A new version of FluentCleaner is ready to download.
ro_ro: O nouă versiune FluentCleaner este gata pentru descărcare.

# St_UpToDate
source: You're up to date
ro_ro: Aplicația este actualizată

# St_UpToDateMessage
source: Version {0} is the latest.
ro_ro: Versiunea {0} este cea mai recentă.

# St_MenuUpdate
source: ⬆ Update available — {0}
ro_ro: ⬆ Actualizare disponibilă — {0}

# St_MenuCheckUpdates
source: Check for updates
ro_ro: Verifică actualizările

# St_ApiKeyMissing
source: ⚠ Enter an API key first.
ro_ro: ⚠ Introduceți mai întâi o cheie API.

# St_ApiKeyTesting
source: Testing…
ro_ro: Se testează…

# St_ExportSuccess
source: Settings exported to {0}
ro_ro: Setările au fost exportate în {0}

# St_ExportFailed
source: Export failed: {0}
ro_ro: Exportul a eșuat: {0}

# St_ImportSuccess
source: Settings imported from {0}
ro_ro: Setările au fost importate din {0}

# St_ImportFailed
source: Import failed: {0}
ro_ro: Importul a eșuat: {0}

# CustomTitle.Text
source: Custom Cleaners
ro_ro: Curățători personalizați

# CustomEmptyHint.Text
source: No custom cleaners yet.
ro_ro: Nu există încă curățători personalizați.

# CustomEmptyHint2.Text
source: Create a new cleaner — it will appear here automatically.
ro_ro: Creează un curățător nou — acesta va apărea automat aici.

# MenuEditEntry.Text
source: Edit
ro_ro: Editează

# MenuDeleteEntry.Text
source: Delete
ro_ro: Șterge

# MenuTestEntry.Text
source: Test in Rule Lab
ro_ro: Testează în Rule Lab

# MenuRunEntry.Text
source: Run
ro_ro: Rulează

# BtnNewCleaner.Content
source: + New Cleaner
ro_ro: + Curățător nou

# BtnRunScript.Text
source: Run
ro_ro: Rulează

# St_CustomStatus
source: {0} cleaner · {1} enabled
ro_ro: {0} curățători · {1} activați

# St_CustomStatusScripts
source: {0} script(s)
ro_ro: {0} script(uri)

# St_CustomMenuNew
source: New custom cleaner
ro_ro: Curățător personalizat nou

# St_CustomMenuOpenFolder
source: Open Custom folder
ro_ro: Deschide folderul personalizat

# St_CustomMenuReddit
source: Ask on Reddit
ro_ro: Întreabă pe Reddit

# St_CustomMenuNeowin
source: Neowin forums
ro_ro: Forumurile Neowin

# St_CustomMenuShare
source: Share cleaner on GitHub
ro_ro: Partajează curățătorul pe GitHub

# St_CustomToggleFailed
source: Toggle failed: {0}
ro_ro: Schimbarea stării a eșuat: {0}

# St_CustomDeleteTitle
source: Delete "{0}"?
ro_ro: Ștergeți '{0}'?

# St_CustomDeleteMessage
source: This removes the custom cleaner permanently.
ro_ro: Acest curățător personalizat va fi eliminat definitiv.

# St_CustomDeleteConfirm
source: Delete
ro_ro: Șterge

# St_CustomDeleteCancel
source: Cancel
ro_ro: Anulează

# St_CustomRunning
source: Running {0}...
ro_ro: Se rulează {0}...

# St_CustomScriptError
source: {0}: could not read script — {1}
ro_ro: {0}: scriptul nu a putut fi citit — {1}

# St_CustomCompleted
source: {0}: completed successfully.
ro_ro: {0}: finalizat cu succes.

# St_CustomFailed
source: {0}: failed (exit {1}).
ro_ro: {0}: a eșuat (cod de ieșire {1}).

# St_CustomEntryNone
source: no entries parsed
ro_ro: nu a fost analizată nicio intrare

# St_CustomEntryOne
source: 1 entry · {0}
ro_ro: 1 intrare · {0}

# St_CustomEntryMany
source: {0} entries · {1}
ro_ro: {0} intrări · {1}

# St_CustomEntryEnabled
source: enabled
ro_ro: activat

# St_CustomEntryDisabled
source: disabled
ro_ro: dezactivat

# DlgNewCleanerSave
source: Save
ro_ro: Salvează

# DlgNewCleanerCancel
source: Cancel
ro_ro: Anulează

# DlgNewCleanerTypeIni.Content
source: Winapp2 entry (.ini)
ro_ro: Intrare Winapp2 (.ini)

# DlgNewCleanerTypePs1.Content
source: PowerShell script (.ps1)
ro_ro: Script PowerShell (.ps1)

# DlgNewCleanerNameHeader
source: Name
ro_ro: Nume

# DlgNewCleanerNamePlaceholder
source: My Cleaner
ro_ro: Curățătorul meu

# DlgNewCleanerAiPlaceholder
source: Generate with AI - describe what to clean (results may vary)
ro_ro: Generează cu AI — descrie ce dorești să fie curățat (rezultatele pot varia)

# DlgNewCleanerGenerate.Content
source: Generate
ro_ro: Generează

# DlgNewCleanerGenerateBtn
source: Generate
ro_ro: Generează

# DlgNewCleanerContentLabel
source: Content
ro_ro: Conținut

# DlgNewCleanerTest
source: Test in Rule Lab
ro_ro: Testează în Rule Lab

# DlgNewCleanerLoadTemplate.Content
source: Load template
ro_ro: Încarcă șablon

# DlgNewCleanerTitleNew
source: New custom cleaner
ro_ro: Curățător personalizat nou

# DlgNewCleanerTitleEdit
source: Edit — {0}
ro_ro: Editează — {0}

# AI_NoKey
source: No API key configured. Go to Settings → AI explanations to add your Groq API key (free at console.groq.com).
ro_ro: Nu este configurată nicio cheie API pentru furnizorul selectat. Accesați Setări → Explicații AI pentru a adăuga una.

# AI_ApiError
source: Groq API error: {0}
ro_ro: Eroare API {0}: {1}

# AI_NoResponse
source: No response received.
ro_ro: Nu a fost primit niciun răspuns.

# AI_NetworkError
source: Could not reach Groq API: {0}
ro_ro: Nu s-a putut realiza conexiunea la {0}: {1}

# AI_NoKeyShort
source: No API key configured — go to Settings → AI explanations.
ro_ro: Nu este configurată nicio cheie API — accesați Setări → Explicații AI.

# TerminalPlaceholder.PlaceholderText
source: clean firefox · analyze chrome · help
ro_ro: curăță firefox · analizează chrome · ajutor

# CLI_Welcome
source: FluentCleaner Terminal online.
ro_ro: Terminalul FluentCleaner este pregătit.

# CLI_Databases
source: Databases: {0} active — {1} detected entries
ro_ro: Baze de date: {0} active — {1} intrări detectate

# CLI_HelpHint
source: Type 'help' for commands.
ro_ro: Tastați 'ajutor' pentru lista comenzilor.

# CLI_UnknownCommand
source: Unknown command '{0}'. Type 'help'.
ro_ro: Comandă necunoscută '{0}'. Tastați „help”.

# CLI_NoDrives
source: No drives found.
ro_ro: Nu au fost găsite unități.

# CLI_ThemeUsage
source: Usage: theme dark | light | system
ro_ro: Utilizare: theme dark | light | system

# CLI_ThemeSet
source: Theme set to '{0}'.
ro_ro: Tema a fost setată la '{0}'.

# CLI_BackdropUsage
source: Usage: backdrop mica | acrylic
ro_ro: Utilizare: backdrop mica | acrylic

# CLI_BackdropSet
source: Backdrop set to '{0}'.
ro_ro: Fundalul a fost setat la '{0}'.

# CLI_NoMatch
source: No entries matching '{0}'.
ro_ro: Nu există intrări care corespund cu '{0}'.

# CLI_CleanEntry
source: {0}: {1} items · {2}
ro_ro: {0}: {1} elemente · {2}

# CLI_CleanDone
source: Done — {0} items removed · {1} freed.
ro_ro: Gata — {0} elemente eliminate · {1} eliberați.

# CLI_NothingToClean
source: Nothing to clean.
ro_ro: Nimic de curățat.

# CLI_AnalyzeEntry
source: {0}: {1} files · {2} registry · {3}
ro_ro: {0}: {1} fișiere · {2} elemente din registru · {3}

# CLI_AnalyzeTotal
source: Total: {0} found.
ro_ro: Total: {0} găsite.

# CLI_NothingFound
source: Nothing found.
ro_ro: Nu s-a găsit nimic.

# CLI_ListEntries
source: — {0} entries.
ro_ro: — {0} intrări.

# CLI_ListCategories
source: — {0} categories.
ro_ro: — {0} categorii.

# CLI_AppxUsage
source: Usage: appx list | appx scan | appx remove <name> | appx remove all
ro_ro: Utilizare: appx list | appx scan | appx remove <nume> | appx remove all

# CLI_AppxListStart
source: Listing all installed AppX packages...
ro_ro: Se listează toate pachetele AppX instalate...

# CLI_AppxNoPackages
source: No packages found.
ro_ro: Nu au fost găsite pachete.

# CLI_AppxListDone
source: — {0} package(s) installed. Use 'appx remove <name>' to uninstall.
ro_ro: — {0} pachet(e) instalat(e). Folosiți 'appx remove <nume>' pentru dezinstalare.

# CLI_AppxScanStart
source: Scanning installed packages...
ro_ro: Se scanează pachetele instalate...

# CLI_AppxNothingFound
source: Nothing found — system looks clean.
ro_ro: Nu s-a găsit nimic — sistemul pare curat.

# CLI_AppxScanDone
source: — {0} package(s) found. Use 'appx remove <name>' or 'appx remove all'.
ro_ro: — {0} pachet(e) găsit(e). Folosiți 'appx remove <nume>' sau 'appx remove all'.

# CLI_AppxRemoveUsage
source: Usage: appx remove <name> | appx remove all
ro_ro: Utilizare: appx remove <nume> | appx remove all
